Revit 2027 API
ParameterTypeId.StructuralAnalyticalBeamRigidLink Property
 "Analytical Links"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructuralAnalyticalBeamRigidLink { get; }
Public Shared ReadOnly Property StructuralAnalyticalBeamRigidLink As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructuralAnalyticalBeamRigidLink {
	ForgeTypeId^ get ();
}
static member StructuralAnalyticalBeamRigidLink : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace